dataset_gen/Earlier_Datasets/NS_PwC_openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(-0.026883170365995544 0.01681875268392119 0.0)
(-0.022215712606818677 0.032989294861156745 0.0)
(-0.021232946739775705 0.042865895381837736 0.0)
(-0.01576037207796422 0.0586873710741523 0.0)
(-0.01515761568347085 0.062067242230923754 0.0)
(-0.009850343206939503 0.07735353521108543 0.0)
(-0.009048700402174903 0.07398033823693681 0.0)
(-0.003500558409221526 0.08848021920189919 0.0)
...
);

boundaryField
{
    left
    {
        type cyclic;
    }
    right
    {
        type cyclic;
    }
    bottom
    {
        type cyclic;
    }
    top
    {
        type cyclic;
    }
    frontAndBack
    {
        type empty;
    }
}
